src/main/resources/templates/CreateContractReq.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header>
        <SessionContextStr xmlns="http://www.openwaygroup.com/wsint">?</SessionContextStr>
        <UserInfo xmlns="http://www.openwaygroup.com/wsint">officer="WX_ADMIN"</UserInfo>
        <CorrelationId xmlns="http://www.openwaygroup.com/wsint">?</CorrelationId>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns2:CreateContractV4 xmlns:ns2="http://www.openwaygroup.com/wsint">
            <ns2:ClientSearchMethod>CLIENT_NUMBER</ns2:ClientSearchMethod>
            <ns2:ClientIdentifier>1111233344445</ns2:ClientIdentifier>
            <ns2:Reason>test create contract</ns2:Reason>
            <ns2:CreateContract_InObject>
                <ns2:Branch>0101</ns2:Branch>
                <ns2:InstitutionCode>0001</ns2:InstitutionCode>
                <ns2:ProductCode>ISS_CR_P_LIB</ns2:ProductCode>
                <ns2:ContractName>Liability Contract</ns2:ContractName>
                <ns2:CBSNumber>2222344322</ns2:CBSNumber>
            </ns2:CreateContract_InObject>
            <ns2:SetCustomData_InObject>
                <ns2:AddInfoType>AddInfo01</ns2:AddInfoType>
                <ns2:TagName>PrevID_01</ns2:TagName>
                <ns2:TagValue>A1</ns2:TagValue>
            </ns2:SetCustomData_InObject>
        </ns2:CreateContractV4>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
